Autodesk.Revit.DB.ValueParsingOptions.SetFormatOptions(Autodesk.Revit.DB.FormatOptions)
Sets the FormatOptions to optionally override the default settings in the Units class.
Remarks:
By default, the FormatOptions represents default formatting
(UseDefault is true) and the FormatOptions in the Units class will
be used.
formatOptions:
The FormatOptions.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014